[
  {
    "name": "Jake Wolter",
    "id": "jmw",
    "role": "Employer",
    "email": "jake@jmwtransfer.com",
    "message": "JMW Transfer was looking to update our website with an interactive application process and new design. With the growth of our trucking company, filling out paper applications for our potential applicants was time-consuming and sometimes not legible. We turned to Shae to design an online application that drivers could fill out and submit through our website. Shae met all of our needs with the design and implementation of an online application process. He recreated our website with a clean design and a user-friendly experience. The process did have some bumps along the way, but Shae was very responsive and made the necessary changes in a super speedy timeframe to improve the user experience. He is professional and did a great job listening to our needs and then implementing the objectives at hand.",
    "signature": "Jake Wolter",
    "signature_title": "JMW Transfer, Inc. CEO"
  },
  {
    "name": "Riley Killian",
    "id": "rk",
    "role": "Client",
    "email": "info@rkvideos-co.com",
    "message": "Shae was wonderful to work with! His quick responses and dedication to getting to what I wanted was more than appreciated. He answered all questions I had regarding migrating my website from a platform to a custom-made site and was able to migrate everything in perfect order! I highly recommend!",
    "signature": "Riley Killian",
    "signature_title": "RK Videos Co. Owner"
  },
  {
    "name": "Mason Wertel",
    "id": "capstone",
    "role": "CAPSTONE Groupmate",
    "email": "mmwertel@gmail.com",
    "message": "Shae and I were part of the same group for our Capstone project—a large group assignment that allows students to demonstrate all of the knowledge they've obtained throughout college in their final two semesters. While working on the project, Shae was almost always available and willing to help whenever anyone ran into an issue. He was also consistently present at our weekly group meetings, and if he couldn't attend, he made sure to notify everyone in advance. Even on the rare occasions when Shae was unavailable, he ensured that all of his work was up to date before the meeting. Overall, Shae is one of the most hard-working, caring, and detail-oriented individuals I've had the pleasure of meeting and working with.",
    "signature": "Mason Wertel",
    "signature_title": "B.S. Computer Science, UWM Class of 2024"
  },
  {
    "name": "Bijay Panta",
    "id": "capstone",
    "role": "CAPSTONE Groupmate",
    "email": "pantabijay@gmail.com",
    "message": "I worked with Shae on our capstone project from Spring 2024 to Fall 2024. Our group initially divided responsibilities between front-end and back-end development. Shae was originally part of the front-end team with me and one other teammate. However, after our first sprint—where both the front-end and back-end had minimal results—Shae quickly stepped up and transitioned from a regular team member into a strong leader. He took initiative by organizing meetings, setting up one-on-ones with teammates who were falling behind, and making sure everyone stayed on track. What stood out most was his enthusiasm and openness—he encouraged questions and frequently shared useful tools, such as UI design platforms, to help the front-end team improve. Overall, Shae was a great person to work with and demonstrated excellent leadership throughout the project.",
    "signature": "Bijay Panta",
    "signature_title": "B.S. Computer Science, UWM Class of 2024"
  }
]